{
  "navbar": {
    "whyMe": "Warum ich",
    "skills": "Kenntnisse",
    "projects": "Projekte",
    "contact": "Kontakt"
  },

  "whyMe": {
    "title": "Warum ich",
    "iAm": "Ich lebe",
    "located": "in Berlin",
    "remote": "offen für mobiles Arbeiten",
    "relocade": "bereit meinen Standort zu wechseln",
    "tripplePoint": " ...",
    "description": "Ich bin ein leidenschaftlicher Frontend Developer mit einem starken Fokus auf die Entwicklung ansprechender und benutzerfreundlicher Webanwendungen. Mit einem guten Auge für Design und dem Anspruch an saubere, effiziente Code möchte ich digitale Erlebnisse schaffen, die sowohl Nutzerbedürfnisse als auch Business-Ziele erfüllen.",
    "letsTalk": "Lass uns reden"
  },

  "skills": {
    "title": "Kenntnisse",
    "currentlyLearning": "Ich lerne gerade",
    "description": "Ich bilde mich aktuell als Backend Developer weiter, um nach Abschluss als Full Stack Developer arbeiten zu können."
  },

  "myProjects": {
    "title": "Meine Projekte",
    "tabsAriaLabel": "Projekte",
    "durationLabel": "Dauer:",
    "aboutTitle": "Über das Projekt",
    "organisationTitle": "Wie ich meinen Arbeitsprozess organisiert habe",
    "takeawaysTitle": "Meine Team-Erfahrung",
    "technologiesTitle": "Technologien",
    "liveTest": "Live Test",
    "github": "GitHub",
    "projects": {
      "project1": {
        "tabLabel": "1. Projekt",
        "title": "Team-Chat App",
        "duration": "4 Wochen",
        "about": "Eine Slack-inspirierte Team-Chat-App mit Fokus auf schnelle Zusammenarbeit: Echtzeit-Nachrichten, Channels und eine klare, ablenkungsfreie UI.",
        "organisation": "Ich habe die App in wiederverwendbare Komponenten aufgeteilt (Navbar, Channel-Liste, Nachrichtenliste, Composer) und Features in kleine, gut testbare Module gegliedert. Klare Benennungen, konsistente Ordnerstruktur und kleine Aufgaben-Pakete haben die Wartbarkeit verbessert.",
        "takeaways": "Wir waren ein Team von 3 Personen. Ich habe die Chat-UI (Nachrichtenliste + Composer), die Channel-Navigation und das State-Handling für den Channel-Wechsel umgesetzt. Durch kurze Abstimmungen und schnelle Review-Zyklen lief die Zusammenarbeit sehr flüssig."
      },
      "project2": {
        "tabLabel": "2. Projekt",
        "title": "Kanban Task Board",
        "duration": "2 Wochen",
        "about": "Ein leichtgewichtiges Kanban-Board zur Aufgabenverwaltung mit Spalten, Drag & Drop, schnellen Änderungen und einer Übersicht, die auch bei vielen Cards lesbar bleibt.",
        "organisation": "Ich bin mit einem klaren Datenmodell gestartet (Board → Spalten → Cards) und habe die UI aus kleinen Komponenten aufgebaut. Logik habe ich aus den Templates in Methoden ausgelagert, was Refactorings deutlich einfacher gemacht hat.",
        "takeaways": "Ich habe gelernt, UI-State sauber zu modellieren (ausgewählte Card, gefilterte Ansicht, Edit-Mode) und Komponenten fokussiert zu halten. Außerdem hat es meine CSS-Struktur (Spacing, wiederverwendbare Klassen) und mein TypeScript-Typing verbessert."
      },
      "project3": {
        "tabLabel": "3. Projekt",
        "title": "Recipe Finder",
        "duration": "3 Wochen",
        "about": "Eine Rezept-Such-App, mit der Nutzer Gerichte nach Zutaten entdecken, Details ansehen und Favoriten speichern können. Fokus: Klarheit, Geschwindigkeit und eine freundliche UI.",
        "organisation": "Wir haben die App in Features geschnitten (Suche, Detail, Favoriten) und früh Namenskonventionen abgestimmt. API-Calls haben wir in einem Service gebündelt, um Duplikate zu vermeiden.",
        "takeaways": "Wir waren ein Team von 2 Personen. Ich habe die Search- und Results-UI gebaut und den API-Service integriert, während mein Teampartner Routing und die Favoriten-Ansicht übernommen hat. Pair-Debugging und kurze Code-Reviews haben geholfen, konsistent zu bleiben."
      },
      "project4": {
        "tabLabel": "4. Projekt",
        "title": "Portfolio Website",
        "duration": "1 Woche",
        "about": "Eine responsive Portfolio-Website, um Projekte, Skills und Kontaktinfos mit klarer Navigation, smooth scrolling und konsistentem Styling zu präsentieren.",
        "organisation": "Ich habe ein kleines Designsystem (Farben, Abstände, Typografie) erstellt und Komponenten wiederverwendet (Navbar, Sections, Cards). Ich bin in kleinen Schritten iteriert und habe Styles modular gehalten, um Seiteneffekte zu vermeiden.",
        "takeaways": "Ich habe meine Responsive-Layout-Skills (Flex/Grid + clamp) verbessert und gelernt, CSS-\"Drift\" durch konsistente Abstände und wiederverwendbare Klassen zu vermeiden. Außerdem wurde ich besser darin, Sections für Accessibility und Lesbarkeit zu strukturieren."
      }
    }
  },

  "colleagueFeedback": {
    "title": "Du brauchst einen Teamplayer? Das sagen meine Kollegen über mich",
    "ariaLabel": "Feedback von Kollegen",
    "projectLabel": "Projekt",
    "linkedinLabel": "LinkedIn",
    "items": {
      "feedback1": {
        "name": "Name des Kollegen",
        "project": "Team-Chat App",
        "quote": "Marcel ist extrem zuverlässig, kommuniziert klar und liefert UI schnell, ohne Qualität zu verlieren. Ein super Teammate bei Reviews und Debugging."
      },
      "feedback2": {
        "name": "Name des Kollegen",
        "project": "Recipe Finder",
        "quote": "Er übernimmt Verantwortung, strukturiert Aufgaben sauber und bleibt auch unter Druck ruhig. Die Zusammenarbeit war sehr angenehm und Übergaben waren immer klar."
      },
      "feedback3": {
        "name": "Name des Kollegen",
        "project": "Gruppenprojekt",
        "quote": "Marcel ist proaktiv und sehr detailorientiert. Er erkennt Edge Cases früh und verbessert die UX mit smarten, einfachen Lösungen."
      }
    }
  },

  "contactMe": {
    "title": "Kontakt aufnehmen",
    "intro": "Ich freue mich über Jobangebote und spannende Projektmöglichkeiten. Ich arbeite kollaborativ, sehr genau und zielorientiert und habe ein gutes Auge für saubere, ästhetische, benutzerfreundliche Oberflächen. Ich bin hoch motiviert und entwickle mich ständig weiter – gerne per E-Mail oder Telefon melden!",
    "mail": "E-Mail: marcel.soerensen@icloud.com",
    "phone": "Telefon: +49 176 310 55 989"
  },

  "contactForm": {
    "nameLabel": "Dein Name",
    "nameRequired": "Name ist erforderlich",
    "emailLabel": "Deine E-Mail",
    "emailRequired": "E-Mail ist erforderlich",
    "emailInvalid": "Bitte gib eine gültige E-Mail ein",
    "messageLabel": "Deine Nachricht",
    "messageRequired": "Nachricht ist erforderlich",
    "privacyTextLeft": "Ich habe die ",
    "privacyLink": "Datenschutzerklärung",
    "privacyTextRight": " gelesen und stimme der Verarbeitung meiner Daten zu.",
    "privacyRequired": "Bitte akzeptiere die Datenschutzerklärung.",
    "send": "Senden"
  },

  "footer": {
    "legalNotice": "Impressum"
  },

  "legalNotice": {
    "title": "Impressum",
    "imprintTitle": "Impressum",
    "exploringTitle": "Kontakt",
    "emailLabel": "E-Mail",
    "acceptanceTitle": "Akzeptanz der Bedingungen",
    "acceptanceText": "Durch den Zugriff auf und die Nutzung von Portfolio (Produkt) erkennen Sie die folgenden Bedingungen sowie alle Richtlinien, Leitlinien oder Änderungen an, die Ihnen von Zeit zu Zeit vorgelegt werden können. Wir, die aufgeführten Studierenden, können die Bedingungen jederzeit ohne vorherige Ankündigung aktualisieren oder ändern.",
    "scopeTitle": "Geltungsbereich und Eigentum am Produkt",
    "scopeText1": "Portfolio wurde im Rahmen eines studentischen Gruppenprojekts in einem Webentwicklungs-Bootcamp der Developer Akademie GmbH entwickelt. Es dient Bildungszwecken und ist nicht für eine umfangreiche private oder geschäftliche Nutzung vorgesehen. Daher können wir keine durchgängige Verfügbarkeit, Zuverlässigkeit, Genauigkeit oder andere Qualitätsmerkmale dieses Produkts garantieren.",
    "scopeText2": "Das Design von Portfolio ist Eigentum der Developer Akademie GmbH. Die unbefugte Nutzung, Vervielfältigung, Veränderung, Verbreitung oder Reproduktion des Designs ist strengstens untersagt.",
    "rightsTitle": "Schutzrechte",
    "rightsText": "Abgesehen vom Design, das der Developer Akademie GmbH gehört, behalten wir, die aufgeführten Studierenden, alle Schutzrechte an Portfolio, einschließlich aller zugehörigen urheberrechtlich geschützten Materialien, Marken und sonstigen proprietären Informationen.",
    "useTitle": "Nutzung des Produkts",
    "useText": "Portfolio darf ausschließlich zu rechtmäßigen Zwecken und im Einklang mit allen geltenden Gesetzen und Vorschriften genutzt werden. Jede Nutzung von Portfolio für illegale Aktivitäten oder zur Belästigung, Schädigung, Bedrohung oder Einschüchterung anderer Personen ist strengstens untersagt. Sie sind allein verantwortlich für Ihre Interaktionen mit anderen Nutzern von Portfolio.",
    "disclaimerTitle": "Haftungsausschluss und Haftungsbeschränkung",
    "disclaimerText": "Portfolio wird \"wie besehen\" und ohne jegliche Gewährleistung bereitgestellt, weder ausdrücklich noch stillschweigend, einschließlich, aber nicht beschränkt auf stillschweigende Gewährleistungen der Marktgängigkeit, Eignung für einen bestimmten Zweck und Nichtverletzung von Rechten Dritter. In keinem Fall haften wir, die aufgeführten Studierenden, oder die Developer Akademie für direkte, indirekte, zufällige, besondere, Folge- oder exemplarische Schäden, einschließlich, aber nicht beschränkt auf Schäden durch entgangenen Gewinn, Goodwill, Nutzungsausfall, Datenverlust oder sonstige immaterielle Verluste, selbst wenn wir auf die Möglichkeit solcher Schäden hingewiesen wurden, die aus der Nutzung oder Leistung von Portfolio entstehen oder damit in Zusammenhang stehen.",
    "indemnityTitle": "Freistellung",
    "indemnityText": "Sie erklären sich damit einverstanden, uns, die aufgeführten Studierenden, die Developer Akademie sowie unsere verbundenen Unternehmen, Partner, Organe, Vertreter und Mitarbeitenden von sämtlichen Ansprüchen, Forderungen, Verlusten, Schäden, Kosten oder Verbindlichkeiten (einschließlich angemessener Anwaltskosten) freizustellen und schadlos zu halten, die aus Ihrer Nutzung von Portfolio und/oder Ihrem Verstoß gegen dieses Impressum entstehen oder damit zusammenhängen.",
    "questionsLine": "Bei Fragen oder Hinweisen kontaktieren Sie uns bitte unter",
    "dateLine": "Datum: 11. Februar 2026"
  }
}
