{
  "navbar": {
    "whyMe": "Why me",
    "skills": "Skills",
    "projects": "Projects",
    "contact": "Contact"
  },
  
  "whyMe": {
    "title": "Why Me",
    "iAm": "I am",
    "location": "located in Berlin..|",
    "description": "I am a passionate frontend developer with a strong focus on creating engaging and user-friendly web applications. With a keen eye for design and a commitment to clean, efficient code, I strive to deliver exceptional digital experiences that meet both user needs and business goals."
  },
  "skills": {
    "title": "Skills",
    "currentlyLearning": "I am currently learning",
    "description": "I am currently pursuing further training as a backend developer, which will enable me to work as a full stack developer upon completion."
  },
  
  "myProjects": {
    "title": "My Projects",
    "tabsAriaLabel": "Projects",
    "durationLabel": "Duration:",
    "aboutTitle": "About the project",
    "organisationTitle": "How I have organised my work process",
    "takeawaysTitle": "My group work experience",
    "technologiesTitle": "Technologies",
    "liveTest": "Live Test",
    "github": "GitHub",
    "projects": {
      "project1": {
        "tabLabel": "1. Project",
        "title": "Team Chat App",
        "duration": "4 Weeks",
        "about": "A Slack-inspired team chat app focused on fast collaboration: real-time messaging, channels, and a clean, distraction-free UI.",
        "organisation": "I broke the app into reusable components (navbar, channel list, message list, composer) and kept features in small, testable modules. Clear naming, consistent folder structure, and short PR-sized tasks helped keep the codebase maintainable.",
        "takeaways": "We were a team of 3. I implemented the chat UI (message list + composer), channel navigation, and state handling for switching channels. We coordinated via daily standups and short review cycles, which kept the collaboration smooth."
      },
      "project2": {
        "tabLabel": "2. Project",
        "title": "Kanban Task Board",
        "duration": "2 Weeks",
        "about": "A lightweight Kanban board to manage tasks with columns, drag & drop, quick edits, and an overview that stays readable even with many cards.",
        "organisation": "I started with a clear data model (board → columns → cards) and built the UI from small components. I used consistent naming and kept logic out of templates by moving it into helper methods, which made refactoring painless.",
        "takeaways": "I learned how to model UI state cleanly (selected card, filtered view, edit mode) and how to keep components focused. It also improved my CSS structure (spacing system, reusable classes) and TypeScript typing for predictable code."
      },
      "project3": {
        "tabLabel": "3. Project",
        "title": "Recipe Finder",
        "duration": "3 Weeks",
        "about": "A recipe search app that lets users discover meals by ingredients, view details, and save favorites. The focus is on clarity, speed, and a friendly UI.",
        "organisation": "We split the app into feature slices (search, detail, favorites) and aligned on naming conventions early. I documented component responsibilities and kept API calls in one service to avoid duplication.",
        "takeaways": "We worked in a team of 2. I built the search + results UI and integrated the API service, while my teammate handled routing and the favorites view. Pair debugging and quick code reviews helped us stay consistent."
      },
      "project4": {
        "tabLabel": "4. Project",
        "title": "Portfolio Website",
        "duration": "1 Week",
        "about": "A responsive portfolio website to present my projects, skills, and contact information with clear navigation, smooth scrolling, and consistent styling.",
        "organisation": "I created a small design system (colors, spacing, typography) and reused components (navbar, sections, cards). I iterated in small steps and kept styles modular to avoid side effects across sections.",
        "takeaways": "I improved my responsive layout skills (flex/grid + clamp) and learned to avoid “CSS drift” by using consistent spacing and reusable class patterns. I also got better at structuring sections for accessibility and readability."
      }
    }
  },

  "colleagueFeedback": {
    "title": "Need a team player? Here’s what my colleagues said about me",
    "ariaLabel": "Colleague feedback",
    "projectLabel": "Project",
    "linkedinLabel": "LinkedIn",
    "items": {
      "feedback1": {
        "name": "Colleague Name",
        "project": "Team Chat App",
        "quote": "Marcel is highly reliable, communicates clearly, and delivers UI work fast without sacrificing quality. Great teammate in reviews and debugging."
      },
      "feedback2": {
        "name": "Colleague Name",
        "project": "Recipe Finder",
        "quote": "He takes ownership, keeps tasks structured, and stays calm under pressure. Collaboration felt smooth and the handoffs were always clean."
      },
      "feedback3": {
        "name": "Colleague Name",
        "project": "Group Project",
        "quote": "Marcel is proactive and detail-oriented. He spots edge cases early and improves the overall UX with smart, simple solutions."
      }
    }
  },

  "footer": {
    "legalNotice": "Legal Notice"
  },

  "legalNotice": {
    "title": "Legal Notice",
    "imprintTitle": "Imprint",
    "exploringTitle": "Exploring the Board",
    "emailLabel": "Email",
    "acceptanceTitle": "Acceptance of terms",
    "acceptanceText": "By accessing and using Portfolio (Product), you acknowledge and agree to the following terms and conditions, and any policies, guidelines, or amendments thereto that may be presented to you from time to time. We, the listed students, may update or change the terms and conditions from time to time without notice.",
    "scopeTitle": "Scope and ownership of the product",
    "scopeText1": "Portfolio has been developed as part of a student group project in a web development bootcamp at the Developer Akademie GmbH. It has an educational purpose and is not intended for extensive personal & business usage. As such, we cannot guarantee consistent availability, reliability, accuracy, or any other aspect of quality regarding this Product.",
    "scopeText2": "The design of Portfolio is owned by the Developer Akademie GmbH. Unauthorized use, reproduction, modification, distribution, or replication of the design is strictly prohibited.",
    "rightsTitle": "Proprietary rights",
    "rightsText": "Aside from the design owned by Developer Akademie GmbH, we, the listed students, retain all proprietary rights in Portfolio, including any associated copyrighted material, trademarks, and other proprietary information.",
    "useTitle": "Use of the product",
    "useText": "Portfolio is intended to be used for lawful purposes only, in accordance with all applicable laws and regulations. Any use of Portfolio for illegal activities, or to harass, harm, threaten, or intimidate another person, is strictly prohibited. You are solely responsible for your interactions with other users of Portfolio.",
    "disclaimerTitle": "Disclaimer of warranties and limitation of liability",
    "disclaimerText": "Portfolio is provided \"as is\" without warranty of any kind, whether express or implied, including but not limited to the implied warranties of merchantability, fitness for a particular purpose, and non-infringement. In no event will we, the listed students, or the Developer Akademie, be liable for any direct, indirect, incidental, special, consequential or exemplary damages, including but not limited to, damages for loss of profits, goodwill, use, data, or other intangible losses, even if we have been advised of the possibility of such damages, arising out of or in connection with the use or performance of Portfolio.",
    "indemnityTitle": "Indemnity",
    "indemnityText": "You agree to indemnify, defend and hold harmless us, the listed students, the Developer Akademie, and our affiliates, partners, officers, directors, agents, and employees, from and against any claim, demand, loss, damage, cost, or liability (including reasonable legal fees) arising out of or relating to your use of Portfolio and/or your breach of this Legal Notice.",
    "questionsLine": "For any questions or notices, please contact us at",
    "dateLine": "Date: February 11, 2026"
  }
}
